import React from "react";

const PrivacyPolicy = () => {
  return (
    <div
      className="blog-details my-5 pb-5 custom_font"
      style={{ direction: "rtl" }}
    >
      <h1 className="mb-5 text-xl font-bold">سياسة الخصوصية</h1>

      <h2 className="text-lg font-bold mt-4">1- المقدمة</h2>
      <p className="text-gray-700">
        تلتزم منصة شورى للذكاء الاصطناعي (&quot;المنصة&quot;)، المملوكة لشركة
        شورى لتقنية المعلومات، ويشار إليها فيما بعد بـ (&quot;الشركة&quot;)
        بحماية خصوصية وسرية بيانات مستخدميها، وفقًا لأحكام نظام حماية البيانات
        الشخصية ولوائحه التنفيذية الصادرة بالمرسوم الملكي رقم (م/19) بتاريخ
        09/02/1443 هـ. توضح هذه السياسة أنواع البيانات الشخصية التي يتم جمعها
        واستخدامها ومعالجتها وتخزينها، وأغراض جمعها قبل المنصة، والمسوغات
        النظامية لمعالجتها، والجهات التي قد يتم الإفصاح لها عن تلك البيانات،
        وفترات الاحتفاظ بالبيانات وسياسة إتلافها، بالإضافة إلى بيان حقوق أصحاب
        البيانات الشخصية وآلية ممارسة هذه الحقوق وسبل التواصل مع الجهة المعنية
        بحماية البيانات. كما تؤكد الشركة التزامها باتخاذ التدابير اللازمة لضمان
        إتاحة بيانات الأفراد لهم بطرق واضحة وسهلة، والتزامها بالحفاظ على سرية
        البيانات والتأكيد على استخدامها فقط عند حاجة المنصة لها لتقديم الخدمات
        بكفاءة وبما يتوافق مع الأنظمة المعمول بها في المملكة العربية السعودية.
        ويعد استخدامك للمنصة أو موقعها الإلكتروني موافقة ضمنية منك على جميع ما
        ورد في هذه السياسة.
      </p>

      <h2 className="text-lg font-bold mt-4">2- معلومات التواصل الرسمية</h2>
      <p className="text-gray-700">
        التواصل مع القسم المختص بحماية البيانات الشخصية في الشركة متاح عبر
        المعلومات التالية:
      </p>
      <ul className="list-disc list-inside space-y-2 ms-3 py-2 text-gray-700">
        <li>القسم الفريق المختص: فريق العمليات</li>
        <li>
          العنوان: Prince Muhammad Ibn Saad Ibn Abdulaziz Rd Al Qirawan, Riyadh
          13532, Riyadh 11231, Riyadh 13532
        </li>
        <li>رقم الهاتف: 920033635</li>
        <li>
          البريد الإلكتروني:{" "}
          <a href="mailto:info@shwra.sa" className="text-blue-600">
            info@shwra.sa
          </a>
        </li>
        <li>السجل التجاري: 4650222665</li>
      </ul>

      <h2 className="text-lg font-bold mt-4">
        3- البيانات الشخصية التي يتم جمعها
      </h2>

      <p className="text-gray-700">
        البيانات التي يتم جمعها: الاسم (إلزامي)، البريد الإلكتروني (إلزامي)، رقم
        الهاتف المحمول (إلزامي)، الصورة الشخصية (اختياري). الغرض من جمع البيانات
        أعلاه هو التحقق من هوية صاحب الحساب وتمكين المستخدم من تسجيل الدخول
        وتسهيل استفادة المستخدم من المنصة، بالإضافة إلى متابعة أي استفسارات أو
        اقتراحات أو شكاوى يقدمها المستخدم.
      </p>

      <h2 className="text-lg font-bold mt-4">4- وسائل جمع البيانات</h2>
      <p className="text-gray-700">
        يتم جمع البيانات الشخصية من المستخدمين بإحدى الطريقتين التاليتين:
      </p>

      <ul className="list-disc list-inside space-y-2 ms-3 py-2 text-gray-700">
        <li>
          من خلال إدخال المستخدم لبياناته مباشرة عبر نماذج التسجيل الإلكترونية
          على المنصة. يزودنا المستخدم بالبيانات المطلوبة طوعًا عند إنشاء الحساب
          أو تحديث ملفه الشخصي، ولا يتم جمع أية بيانات شخصية من جهات أخرى في هذه
          العملية.
        </li>
        <li>
          أو عبر تقنيات ملفات تعريف الارتباط (الكوكيز Cookies) عند زيارة
          المستخدم للمنصة. تقوم هذه التقنيات بجمع بعض المعلومات الفنية وسلوكيات
          التصفح بشكل آلي بهدف تحسين تجربة المستخدم على الموقع، وتحليل مدى
          استخدام الخدمات وتخصيص المحتوى بما يلائم اهتماماته.
        </li>
      </ul>

      <h2 className="text-lg font-bold mt-4">
        5- استخدام وتخزين البيانات الشخصية
      </h2>
      <p className="text-gray-700">
        تُستخدم البيانات الشخصية التي يتم جمعها – بشكل مباشر أو غير مباشر –
        لتحقيق الأغراض المذكورة أعلاه، بما في ذلك إتمام عمليات التسجيل في
        المنصة، وتقديم الخدمات المطلوبة، وتحسين تجربة المستخدم وتطوير خدمات
        المنصة بشكل مستمر. تحتفظ المنصة بالبيانات الشخصية في أنظمتها طالما كان
        ذلك ضروريًا لتحقيق تلك الأغراض التي جُمعت من أجلها البيانات، وذلك مع
        الالتزام بالمدة المحددة للاحتفاظ بالبيانات وفق ما سيرد أدناه في سياسة
        الاحتفاظ والإتلاف.
      </p>

      <h2 className="text-lg font-bold mt-4">
        6- سياسة الاحتفاظ وإتلاف البيانات
      </h2>
      <p className="text-gray-700">
        تحتفظ الشركة بالبيانات الشخصية لمدة ثلاث سنوات من تاريخ جمعها ما لم
        تتطلب الأنظمة مدة أطول. بعد انقضاء فترة الاحتفاظ المحددة، يتم إتلف
        البيانات بشكل آمن ونهائي بحيث لا يمكن لأي طرف الاطلاع عليها أو استرجاعها
        مجددًا، وذلك وفق السياسات والإجراءات الداخلية المعتمدة لدى الشركة.
      </p>

      <h2 className="text-lg font-bold mt-4">7- وسائل حماية بيانات الشخصية</h2>
      <p className="text-gray-700">
        تتبنى الشركة مجموعة من التدابير الإدارية والتقنية لحماية البيانات
        الشخصية من مخاطر الفقدان أو التسريب أو الوصول غير المصرح به. وتشمل هذه
        التدابير على سبيل المثال لا الحصر: استخدام تقنيات تشفير البيانات لحماية
        البيانات أثناء نقلها وتخزينها، وتطبيق آليات الترميز (Tokenization)
        وإخفاء الهوية للبيانات الحساسة حيثما أمكن. تهدف هذه الإجراءات إلى ضمان
        الحفاظ على سرية البيانات وسلامتها، وعدم السماح بالوصول إليها إلا للأشخاص
        المصرح لهم فقط، وذلك في جميع مراحل التعامل معها داخل المنصة.
      </p>

      <h2 className="text-lg font-bold mt-4">
        8- المسوغ النظامي لمعالجة البيانات
      </h2>
      <p className="text-gray-700">
        تعتمد الشركة في جمع ومعالجة البيانات الشخصية على مسوغات نظامية مشروعة
        وفقًا لما حدده نظام حماية البيانات الشخصية ولائحته التنفيذية. وتستند
        المنصة في جمع ومعالجة البيانات الشخصية على ما يلي:
      </p>
      <ul className="list-disc list-inside space-y-2 ms-3 py-2 text-gray-700">
        <li>
          يتم جمع ومعالجة البيانات بناءً على موافقة صاحب البيانات الشخصية. ويحق
          لصاحب البيانات سحب موافقته في أي وقت، على أن عدم الموافقة المستقبلية
          لن يؤثر على مشروعية المعالجة التي تمت بناء على الموافقة السابقة، ما لم
          يكن هناك أساس نظامي آخر يقتضي استمرار المعالجة.
        </li>
        <li>
          تحقيق مصالح مشروعة عند معالجة بعض البيانات، مثل تحسين تجربة المستخدم
          في المنصة، أو التحقق من هوية المستخدم، أو حماية حساباته من الوصول غير
          المشروع. ويتم التأكد في هذه الحالات من أن المعالجة لا تمس بحقوق صاحب
          البيانات أو حرياته الأساسية، وأنها ضمن الحدود المتوقعة لتحقيق الخدمات
          المطلوبة.
        </li>
      </ul>

      <h2 className="text-lg font-bold mt-4">9- حقوق صاحب البيانات الشخصية</h2>
      <p className="text-gray-700">
        يتمتع أصحاب البيانات الشخصية بالحقوق المكفولة بموجب نظام حماية البيانات
        الشخصية، والتي تتيح لهم السيطرة على بياناتهم والتحكم في طرق استخدامها.
        ومن أهم هذه الحقوق:
      </p>
      <ul className="list-disc list-inside space-y-2 ms-3 py-2 text-gray-700">
        <li>
          يحق لصاحب البيانات معرفة طرق وآليات جمع بياناته، والأغراض التي من
          أجلها تم جمعها، والأساس النظامي لمعالجتها، وفترة الاحتفاظ بها، وكيفية
          إتلافها، والجهات التي قد يتم مشاركتها معها.
        </li>
        <li>
          يحق لصاحب البيانات طلب الحصول على نسخة من بياناته الشخصية الموجودة لدى
          الشركة بصيغة واضحة ومقروءة إلكترونيًا ومطابقة لمضمون السجلات لدينا.
          سنقوم بتزويده بالنسخة المطلوبة مجانًا خلال سبعة أيام عمل من تاريخ تلقي
          الطلب عبر البريد الإلكتروني. كما يمكن للمستخدم الاطلاع على بيانات
          حسابه مباشرة من خلال صفحة &quot;الإعدادات الشخصية&quot; على منصة{" "}
          <a href="https://shwra.ai" className="text-blue-600">
            shwra.ai
          </a>
          .
        </li>

        <li>
          يحق لصاحب البيانات طلب تصحيح أو تحديث بياناته الشخصية إذا كانت غير
          صحيحة أو غير مكتملة. يمكن تقديم الطلب عبر البريد الإلكتروني الرسمي،
          وستقوم الشركة بمراجعة البيانات وتصحيحها خلال سبعة أيام عمل من تاريخ
          الطلب مع إشعار صاحب البيانات بذلك عبر البريد الإلكتروني. كما يمكن
          للمستخدم تعديل بعض بياناته مباشرة من خلال حسابه على المنصة وفق الضوابط
          التقنية المتاحة.
        </li>
        <li>
          يحق لصاحب البيانات طلب إتلاف بياناته الشخصية التي تحتفظ بها الشركة في
          بعض الحالات، وذلك ما لم يوجد نص نظامي يلزم بالاحتفاظ بها لمدة معينة أو
          متطلب تعاقدي يحول دون ذلك. سيتم تنفيذ طلب الإتلاف عند انطباقه بأسلوب
          آمن وفي حدود ما تسمح به الأنظمة ذات العلاقة، بعد التحقق من هوية مقدم
          الطلب.
        </li>
        <li>
          لصاحب البيانات الحق في سحب موافقته المسبقة على معالجة بياناته الشخصية
          في أي وقت. وسيتوقف معالجة بياناته بناءً على ذلك ما لم يوجد مسوغ نظامي
          آخر يجيز استمرار المعالجة.
        </li>
        <li>
          يحق لصاحب البيانات الاعتراض على معالجة بياناته الشخصية أو طلب تقييدها
          في الحالات التي يحددها النظام. سيتم النظر في طلب الاعتراض وفق أحكام
          النظام واللوائح التنفيذية ذات الصلة.
        </li>
        <li>
          يحق لصاحب البيانات تقديم شكوى للجهات الرقابية المختصة بشأن أي انتهاك
          لأحكام نظام حماية البيانات الشخصية، والمطالبة بتعويض عن أي ضرر مادي أو
          معنوي يلحق به نتيجة هذا الانتهاك، وذلك وفق الإجراءات القانونية المعمول
          بها.
        </li>
      </ul>

      <h2 className="text-lg font-bold mt-4">10- مشاركة البيانات الشخصية</h2>
      <p className="text-gray-700">
        لا تشارك الشركة بياناتك الشخصية مع أطراف ثالثة إلا بموافقتك أو في حالات
        يجيزها النظام. وفي إطار تشغيل المنصة وتحسين الخدمات، قد تستعين الشركة
        ببعض مقدمي الخدمات لمساعدتها، ويتم مشاركة البيانات معهم بالقدر الضروري
        فقط ومع التزامهم بحماية السرية. تجدر الإشارة إلى أن أي جهة يتم مشاركة
        البيانات معها تلتزم تعاقديًا بالحفاظ على سرية البيانات واستخدامها فقط
        للأغراض المحددة ووفق تعليمات الشركة، كما أنها ملتزمة بتطبيق معايير
        الحماية الأمنية للبيانات بما يتوافق مع هذه السياسة ومع أحكام نظام حماية
        البيانات الشخصية.
      </p>

      <h2 className="text-lg font-bold mt-4">
        11- سياسة ملفات تعريف الارتباط (Cookies)
      </h2>
      <p className="text-gray-700">
        تستخدم منصة شورى للذكاء الاصطناعي تقنيات ملفات تعريف الارتباط
        (&quot;الكوكيز&quot;) لجمع معلومات معينة بشكل تلقائي عند زيارة المستخدم
        للموقع. تهدف هذه الملفات إلى تيسير تجربة التصفح من خلال حفظ تفضيلات
        المستخدم وإعداداته، فضلاً عن المساعدة في فهم كيفية استخدام الزوار للموقع
        من أجل تحسين المحتوى والخدمات. يستطيع المستخدم التحكم في إعدادات المتصفح
        الخاص به لقبول أو رفض الكوكيز؛ فإذا قرر تعطيل ملفات الكوكيز تمامًا فقد
        لا تعمل بعض وظائف الموقع بالشكل الأمثل. نوضح للمستخدم أنه برفضه استخدام
        الكوكيز أو حذفها قد تتأثر بعض الميزات المتاحة على المنصة، وقد لا يتمكن
        من الاستفادة من الخدمات بالشكل المخطط له. إن استمرارك في استخدام المنصة
        دون تعديل إعدادات الكوكيز في متصفحك يعني موافقتك الضمنية على استخدامنا
        لهذه الملفات وفق ما هو موضح في هذه السياسة.
      </p>

      <h2 className="text-lg font-bold mt-4">
        12- آلية تقديم الشكاوى والاستفسارات
      </h2>
      <p className="text-gray-700">
        تهدف الشركة إلى توفير قنوات واضحة لمعالجة أي شكوى أو اعتراض يتعلق
        ببياناتك الشخصية. وفي حال كان لديك أي اعتراض على كيفية معالجة بياناتك أو
        رغبة في تقديم شكوى بهذا الخصوص، يرجى اتباع الخطوات التالية:
      </p>
      <ul className="list-disc list-inside space-y-2 ms-3 py-2 text-gray-700">
        <li>
          قم بإرسال شكواك أو اعتراضك إلى قسم حماية البيانات الشخصية لدينا عبر
          البريد الإلكتروني الرسمي المذكور في معلومات التواصل. يجب توضيح موضوع
          الشكوى أو الاعتراض وتفاصيله وأية مستندات مؤيدة إن وجدت. ستتولى الشركة
          دراسة الشكوى والرد عليك خلال مدة أقصاها سبعة أيام عمل من تاريخ
          استلامها.
        </li>
        <li>
          في حال لم يتم الرد خلال المدة المحددة، أو لم يكن الرد مرضيًا لك،
          فيمكنك تصعيد الشكوى إلى الجهة الرقابية المختصة بحماية البيانات الشخصية
          في المملكة العربية السعودية. حاليًا، الجهة المختصة هي مكتب إدارة
          البيانات الوطنية (NDMO)، ويمكن التواصل معه عبر البريد الإلكتروني{" "}
          <a href="mailto:pr@ndmo.gov.sa" className="text-blue-600">
            pr@ndmo.gov.sa
          </a>
          .
        </li>
        <li>
          لأي استفسارات أخرى حول سياسة الخصوصية هذه أو بشأن كيفية معالجة الشركة
          لبياناتك الشخصية، نرحب بتواصلك معنا في أي وقت عبر البريد الإلكتروني
          المشار إليه في قسم معلومات التواصل، وسوف نقوم بالإجابة وتوضيح أي أمور
          بصورة وافية وفي أقرب فرصة ممكنة.
        </li>
      </ul>

      <h2 className="text-lg font-bold mt-4">
        13- إشعارات التعديل وتحديث السياسة
      </h2>
      <p className="text-gray-700">
        تحتفظ الشركة بحقها في تحديث أو تعديل أحكام هذه السياسة من حين لآخر، بما
        يتوافق مع التغييرات النظامية أو التقنية. سيتم إشعار أصحاب البيانات
        الشخصية بأي تعديل جوهري يتم على سياسة الخصوصية عبر وسائل التواصل المسجلة
        لدينا (مثل إرسال إشعار عبر منصة المستخدم، أو عبر البريد الإلكتروني أو
        رسالة نصية). كما تقوم الشركة بمراجعة هذه السياسة دوريًا لتظل متماشية مع
        أفضل الممارسات والتشريعات ذات الصلة، ويتم توثيق أي تغييرات في سجل
        التحديثات الداخلي. لقد تم إجراء آخر تحديث لهذه السياسة بتاريخ _______،
        ويعد استمرارك في استخدام المنصة بعد سريان أي تحديث بمثابة موافقة منك على
        تلك التعديلات. وإذا لم يقبل صاحب البيانات أي تعديلات مستقبلية على
        السياسة، فعليه إشعارنا بذلك، ويحق للشركة حينها إيقاف تقديم الخدمات إليه
        أو تعطيل حسابه.
      </p>

      <h2 className="text-lg font-bold mt-4">
        14- القانون الواجب التطبيق وتسوية النزاعات
      </h2>
      <p className="text-gray-700">
        إن هذه السياسة وجميع ما يتعلق بها من مطالبات أو نزاعات تخضع لأحكام
        القوانين والأنظمة المعمول بها في المملكة العربية السعودية. وفي حالة نشوء
        أي خلاف أو مطالبة نتيجة تطبيق هذه السياسة أو تفسيرها، يكون القانون
        السعودي هو القانون الواجب التطبيق، وتختص محاكم مدينة الرياض بالنظر
        والفصل في أي نزاع ينشأ بهذا الشأن.
      </p>
    </div>
  );
};

export default PrivacyPolicy;
